{
    "profile": {
        "name": "Paul Higgins",
        "headline": "Help Cloud Consultants  to Say No, Be Sought After and Let Go to Scale Faster | Business Coaching | FREE Community | Podcast Host of Accelerate Sales  | Transplant Recipient | Golfing tragic",
        "location": "Australia"
    },
    "about": "You are smart, ambitious and passionate about scaling your Cloud Consulting business. The question is, do you go alone or get some help?Here is my story to see if I can help. At age 18 I was diagnosed with a condition called Polycystic kidney disease (PKD). A condition that plagued my family. Knowing what was to come, I made the most out of it. Always learning and helping others. I started at Coca-Cola and over 18 years, I led large sales teams, transformed billion-dollar business units and led global partnerships. In 2011 the demands of Corporate Directorship forced my hand. I have been on the entrepreneurial journey ever since, taking what I learnt at Coca-Cola - the power of the brand owner and the nimbleness of franschiees. In a way, the Cloud Industry is a better version of the “Coke Way’. I created two Cloud Consultancy businesses - one that didn’t work and one that did.Tapping into my Coke experience and learnings, I was able to create a successful exit by focusing on✅ Niche markets✅ Right business model✅ Predictable Sales Machine✅ Strategic referral partnerships✅ High performing teamAnd you can do this too! Now, I help Cloud Consultants to scale faster than they can alone. Come join our free slack community called Cloud Consultants Collective (CCC) where helpful peers save you time and money. Check it out https://paulhigginsmentoring.com/ccc/_________________________________________________________“I went from a solo operator to selling a cloud consulting business to a google partner - life could not be better. I could not have done this without the support of Paul. His experience across corporate and small business was invaluable.\"Scott Gellatly, CEO of itGenius_________________________________________________Interested in Podcasts? Come listen to the Accelerate Sales Podcast to get actionable insights from peers and experts to help you scale your Cloud Consulting business faster. ✊ Click follow to never miss valuable content.You are smart, ambitious and passionate about scaling your Cloud Consulting business. \n\nThe question is, do you go alone or get some help?\n\nHere is my story to see if I can help. \n\nAt age 18 I was diagnosed with a condition called Polycystic kidney disease (PKD). A condition that plagued my family. \n\nKnowing what was to come, I made the most out of it. Always learning and helping others. \n\nI started at Coca-Cola and over 18 years, I led large sales teams, transformed billion-dollar business units and led global partnerships. \n\nIn 2011 the demands of Corporate Directorship forced my hand. \n\nI have been on the entrepreneurial journey ever since, taking what I learnt at Coca-Cola - the power of the brand owner and the nimbleness of franschiees. \n\nIn a way, the Cloud Industry is a better version of the “Coke Way’. \n\nI created two Cloud Consultancy businesses - one that didn’t work and one that did.\n\nTapping into my Coke experience and learnings, I was able to create a successful exit by focusing on\n\n✅ Niche markets\n✅ Right business model\n✅ Predictable Sales Machine\n✅ Strategic referral partnerships\n✅ High performing team\n\nAnd you can do this too! \n\nNow, I help Cloud Consultants to scale faster than they can alone. \n\nCome join our free slack community called Cloud Consultants Collective (CCC) where helpful peers save you time and money. \n\nCheck it out https://paulhigginsmentoring.com/ccc/\n_________________________________________________________\n\n“I went from a solo operator to selling a cloud consulting business to a google partner - life could not be better. \n\nI could not have done this without the support of Paul. \n\nHis experience across corporate and small business was invaluable.\"\n\nScott Gellatly, CEO of itGenius\n\n_________________________________________________\n\nInterested in Podcasts? \n\nCome listen to the Accelerate Sales Podcast to get actionable insights from peers and experts to help you scale your Cloud Consulting business faster. \n\n✊ Click follow to never miss valuable content.\n\n \n          …see more",
    "skills": [
        "Coaching",
        "Sales",
        "Strategy",
        "Entrepreneurship",
        "Outsourcing",
        "Business Strategy",
        "Consulting",
        "Strategic Planning",
        "Marketing",
        "Business Development",
        "Marketing Strategy",
        "Mergers & Acquisitions (M&A)",
        "Business Transformation",
        "Sales Management",
        "Account Management",
        "Direct Marketing",
        "Business Management",
        "Small Business",
        "Social Media",
        "Lead Generation",
        "Sales",
        "Strategy",
        "Entrepreneurship",
        "Outsourcing",
        "Business Strategy",
        "Consulting",
        "Strategic Planning",
        "Marketing",
        "Business Development",
        "Marketing Strategy",
        "Mergers & Acquisitions (M&A)",
        "Business Transformation",
        "Sales Management",
        "Account Management",
        "Direct Marketing",
        "Business Management",
        "Small Business",
        "Social Media",
        "Lead Generation",
        "New Business Development",
        "saas",
        "Coaching",
        "Training",
        "Time Management",
        "Strategic Thinking",
        "Executive Coaching",
        "Leadership",
        "Team Leadership",
        "Employee Engagement",
        "Executive Management",
        "Team Building",
        "Negotiation",
        "Business Networking",
        "Business Coaching",
        "Management",
        "Business Growth Strategies",
        "Mastermind Groups",
        "Revenue & Profit Growth",
        "Productivity Coaching",
        "Networking",
        "Business Apps",
        "Podcasting",
        "Sales Process Development"
    ],
    "social": [
        "https://www.linkedin.com/in/paulhigginsmentoring/",
        "https://github.com/ishita1805"
    ],
    "experience": [
        {
            "heading": "Paul Higgins Mentoring",
            "roles": [
                [
                    "Help Cloud Consultants to Scale Faster",
                    "Jul 2016 - Present · 5 yrs 8 mos",
                    "Are you a Cloud Consulting Consultant looking for peers to help you scale?\nJoin our free community where you will get actionable answers to save you time and money.\n\nCome join the Cloud Consultants Collective where you will get:\n\n✅ Access to Like-minded peers\n✅ A personal onboarding call\n✅ A free LinkedIn profile upgrade\n✅ Success shortcuts\n✅ A safe place to share your challenges\n✅ Exclusive access to cloud industry experts\n✅ Monthly open mic sessions\n✅ Access to a large network\n\nALL FREE\n\nIs this for you?\nIf you are an owner of a Cloud Consulting Business who is:\n\n✅ Doing all or a combination of Consulting services / Selling Cloud platform licenses / implementing Cloud platforms / training users on Cloud platforms  / Supporting cloud platforms\n✅ Leading a team of <20 staff\n✅ Ambitious to scale\n✅ Open to sharing\n\nTHIS IS FOR YOU\n\nCome check it out \n\nhttps://paulhigginsmentoring.com/ccc/",
                    "Paul Higgins | STRATEGY SPRINTS® - Strategy Sprints",
                    "Ep. 116 | Getting Clients Through LinkedIn the Right Way—with Paul Higgins",
                    "In this Craft of Consulting podcast episode, I interview Paul Higgins who helps consultants develop sales systems that work. He shares his strategies for using LinkedIn the right way to achieve your business goals."
                ],
                [
                    "Host of the Accelerate Sales Podcast",
                    "May 2017 - Present · 4 yrs 10 mos",
                    "If you are looking for sales strategies to scale your Cloud Consulting business - this is worth checking out.\n\nWe cover:\n\n➡️  Interviews with Global experts on Sales strategies \n\n➡️  Interviews from Consultants and Cloud Business owners who have cracked the sales code \n\n➡️  Solo shows sharing Real World examples from clients I work with\n\n\nYou can take years to learn this yourself or fast track it by listening to the episodes. \n\n➡️ Check it out at https://paulhigginsmentoring.com/podcast/  \n\nor search Accelerate sales in your favourite platform",
                    "319 - What Role Sales Plays In Scaling Your Consulting Business With Daniel Marcos - Paul Higgins Mentoring",
                    "Paul Higgins sits down with Daniel Marcos, Co-Founder & CEO at Growth Institute, Coach and Scale-Up Expert.\n\nHe shares with us tips on how he gives executives the support and methodologies that he wishes he had in his entrepreneurial journey: being a good leader, successfully scaling companies, and maintaining a high quality of life.",
                    "318 - Big News & A Brand Update - Paul Higgins Mentoring",
                    "Big News & A Brand Update\nSales Strategies for Consulting Businesses"
                ],
                [
                    "Book Author",
                    "Oct 2019 - Present · 2 yrs 5 mos",
                    "Left corporate and started your consulting and Cloud business - this book is for you. \n\nI cover the first five years of leaving Coca-Cola to build my own businesses. \n\nGrowing a successful consulting business is like travelling on a highway. \n\nWe all had a different destination but what get you is all the detours you have. \n\nIn this book, I eliminate many of them for you. \n\nHear what some of the best minds in our space had to say about it. \n\n\"I interview many global entrepreneurs who have made a substantial impact on the world and I often see a common trait - the ability to take action.\nPaul Higgins gives solopreneurs a low-risk set of proven actions to achieve success – measured by the lifestyle they want to live. Not everyone is going to build a global unicorn and that is okay.\"\n\nNathan Chan, CEO of Foundr magazine\n\n\"I speak five languages and love helping entrepreneurs to build lasting relationships which open doors they can only dream of opening. But the language of small business was very foreign to me when I escaped my corporate lawyer's role.\nPaul Higgins helps solopreneurs to understand the language of small business so they can leverage their strengths to impact more people in the world.\"\n\nJordan Harbinger, Critically acclaimed host of The Jordan Harbinger Show\n\n\"I admire people who speak from actual experience, instead of just theory. Paul is one of those rare thought leaders who follow this rule. His corporate background, his eventual departure, and the life he has been able to build, for himself and others since is a testament to his expertise and heart.\"\u2028\n\nAri Meisel, Founder of Less Doing\n\n\"Paul shares a great story about his transition from being an employee to becoming an Entrepreneur. Remarkably, he has achieved all this whilst living with a major health condition. Inspiring stuff. There are many valuable lessons contained in this book.\"\u2028\n\nJames Schramko, Author of Work Less, Make More, Founder of SuperFastBusiness.com",
                    "Build Live Give Book",
                    "In this book, Paul shares his struggles and challenges.\n\nBut it is not just Paul's journey, it is the journey of hundreds of other solopreneurs who Paul has had the pleasure of working with.\n\nThis collective experience forms the foundation to the Five Rapid Growth Drivers – a roadmap which delivers time and time again.\n\nThis book explains how Paul and others did it, and how you can too.",
                    "Build Live Give Book",
                    "In this book, Paul shares his struggles and challenges.\n\nBut it is not just Paul's journey, it is the journey of hundreds of other solopreneurs who Paul has had the pleasure of working with.\n\nThis collective experience forms the foundation to the Five Rapid Growth Drivers – a roadmap which delivers time and time again.\n\nThis book explains how Paul and others did it, and how you can too."
                ]
            ]
        },
        {
            "heading": "Successful exit of a Cloud Consulting  business",
            "body": [
                "Think to Act · Self-employed",
                "Aug 2011 - Nov 2019 · 8 yrs 4 mos",
                "Melbourne, Australia",
                "They say it takes 10 years to be an overnight success - it took me 8. 😉\n\nWe exited our Cloud partner business in November 2019 to a Google Partner for an above-average multiple. \n\nWas it a straight line - hell no. \n\nWe backed a platform called Podio until Citrix came and spoiled the party. \n\nThe silver lining was it forced us into building our own sales and marketing engine.\n\nThen we evolved to a better horse on a much better track. \n\nWhat else I learnt which I share with my clients today: \n\n1) How to develop a recurring revenue business \n\n2) How to define a niche and win \n\n3) How to build a remote team \n\n4) How to leverage the partner network \n\n5) How to work less and get paid more\n\nIf you would like to learn more, please reach out:\npaul@paulhigginsmentoring.com \n\nps don't forget to follow 😉"
            ]
        },
        {
            "heading": "Coca-Cola Amatil",
            "roles": [
                [
                    "Marketing Director",
                    "Mar 2011 - Aug 2011 · 6 mos",
                    "Melbourne, Australia",
                    "►Marketing Director for $700m+ Business Unit \n►Lead a team of 31 people\n►Member of Executive Team reporting to Group MD \n►Direct Marketing Expenditure budget of mid 8 figures \n►Launched successful New Products - including Goulburn Valley Juices \n►Launched new TVCs and lead agency review\n►Developed a performance driven culture and built internal capabilities\n►Part of the team to get board approval for the Business Unit transformation plan"
                ],
                [
                    "General Manager Strategy & Insights",
                    "Jul 2010 - Mar 2011 · 9 mos",
                    "Melbourne, Australia",
                    "►Lead Strategic Review of a billion dollar Business unit\n ►Lead Due Diligence team to acquire a businesses equal in turnover  \n ►Create a new business unit and lead a team of 12 people to radically change the direction of the business \n ►Presented to the Board the business transformation paper \n ►Develop a new insights team and implemented new agency structure\n ►Learnt how hard it is to compete in low consumer branded segments"
                ],
                [
                    "General Manager",
                    "Jul 2006 - Jul 2010 · 4 yrs 1 mo",
                    "►Lead a cross-functional team to launch Goulburn Valley beverages  delivering an incremental 8 figures in Retail Sales Value growth in 2 years\n ►Lead the due diligence for acquiring major competitors\n ►Integrated an acquisition into the business which successfully saw fresh juice rolled across Australia \n ►Created a global 1st, cold chain solution for chilled beverages\n ►Improved the profitability by 300%  in 2 years\n ►Launched New Products and improved the process\n ►Created and chaired a global Juice forum for TCCC\n ►Board member of the Australia Fruit Juice Association"
                ],
                [
                    "State Manager",
                    "Feb 2005 - Jun 2006 · 1 yr 5 mos",
                    "►Lead a team of 50 sales people\n ►Team engagement score of 85%\n ►Increased sales revenue by 17.5% \n ►Increased sales EBIT by 12.3%\n ►Launched Coca-Coca Zero"
                ],
                [
                    "National Channel Manager",
                    "Feb 2003 - Feb 2005 · 2 yrs 1 mo",
                    "►Developed the strategic channel plan for Hotels, Restaurants and Cafes in Australia\n ►Launched cafe glass \n ►Strategic alliances with global alcohol companies \n ►Build and implemented training for 1000 sales people"
                ],
                [
                    "Various roles",
                    "Jan 1994 - Feb 2003 · 9 yrs 2 mos",
                    "Australia",
                    "1994 \nStarted as a Sales Representative fresh out of university. \nWon key sales awards 2 quarters in a row \n1995\nPromoted to Senior Sales Representative within 12 months \n1996\nAppointed as one of the youngest Sales Managers in the companies history\n1997\nPromoted to the first National Business Manager for Coles Myer \n1999\nPromoted to National Business Manager - Foodservice \n2000\nPromoted to Group Business Manager - Foodservice"
                ]
            ]
        }
    ],
    "education": [
        {
            "institute": "Monash University",
            "body": [
                "Bachelor of Business, Marketing",
                "1991 - 1993"
            ]
        },
        {
            "institute": "Melbourne Business School",
            "body": [
                "Business/Commerce, General",
                "2010 - 2010",
                "Completed the Strategy in Action intensive at Melbourne Business School."
            ]
        },
        {
            "institute": "Monash University",
            "body": [
                "Bachelor of Business, Accounting",
                "1989 - 1991"
            ]
        },
        {
            "institute": "Copper CRM",
            "body": [
                "Computer Programming, Vendor/Product Certification",
                "2018 - 2018",
                "Certified partner to sell and build workflows on the Copper Sales CRM platform"
            ]
        },
        {
            "institute": "HubSpot Academy",
            "body": [
                "Computer Programming, Vendor/Product Certification",
                "2019 - 2019",
                "Completed certification"
            ]
        }
    ],
    "volunteer": [
        {
            "role": "Fundraiser",
            "organization": "The Purple House",
            "body": [
                "Jan 2019 - Present · 3 yrs 2 mos",
                "Health",
                "The Purple House provides life saving dialysis to Indigenous people living in Central Australia. \n\nHaving being on dialysis I know what an impost it is even if you live in a dense metropolitan area like Melbourne Australia. Providing and obtaining these services in the Outback is very challenging. I raise funds through donating a % of our profits and also other activities to make it easier.\n\nI am lucky to have a successful transplant and the renewed energy helps me to Give back."
            ]
        },
        {
            "role": "Volunteer",
            "organization": "PKD Foundation Australia",
            "body": [
                "Jan 2016 - Present · 6 yrs 2 mos",
                "Health",
                "To find a cure for PKD"
            ]
        },
        {
            "role": "Sponsorship Manager",
            "organization": "East Sandringham Junior Football Club",
            "body": [
                "Mar 2018 - Nov 2018 · 9 mos",
                "Children",
                "Helping children fall in love with Australian rules, whilst having some fun with mates.\n\nI had to step down due to my health."
            ]
        }
    ]
}